app/Controllers/ParcController.php

    public function index()
    {
        $model = new VehiculeViewModel;
        $vehicule_dispo = $model->where(['statut' => 'Disponible'])->findAll();
        return view('parc/index',[
            'vehicule' => $this->vehicule->findAll(),
            'clients' => $this->clients->findAll(),
            'vehicule_dispo' => $vehicule_dispo,
            'location_encours' => $this->location_encours->findAll(),
        ]);
---
SELECT *
FROM `clients`
SELECT *
FROM `vehicule`

    public function save()
    {
        $data = [
            'id_vehicule' => $this->request->getPost('vehicule'),
            'id_clients' => $this->request->getPost('clients'),
            'date_debut' => $this->request->getPost('date_debut'),
            'date_fin' => $this->request->getPost('date_fin'),
        ];

        if(!$this->location->save($data))
---
INSERT INTO `location` (`id_vehicule`, `id_clients`, `date_debut`, `date_fin`) VALUES ('3', '1', '2026-07-08', '2026-07-17')